# Append tables

In [1]:
import pandas as pd

In [2]:
dict1 = {
    "A":[1,2],
    "B":[3,4],
    "C":[5,6],
    }

In [3]:
dict2 = {
    "C":[1,2],
    "B":[3,4],
    "D":[5,6],
    }

In [6]:
table1 = pd.DataFrame(dict1)
table1

   A  B  C
0  1  3  5
1  2  4  6

In [7]:
table2 = pd.DataFrame(dict2)
table2

   C  B  D
0  1  3  5
1  2  4  6

In [16]:
combined_tables = table1.append(table2, ignore_index=True)
combined_tables

     A  B  C    D
0  1.0  3  5  NaN
1  2.0  4  6  NaN
2  NaN  3  1  5.0
3  NaN  4  2  6.0

In [17]:
combined_tables.to_dict()

{'A': {0: 1.0, 1: 2.0, 2: nan, 3: nan},
 'B': {0: 3, 1: 4, 2: 3, 3: 4},
 'C': {0: 5, 1: 6, 2: 1, 3: 2},
 'D': {0: nan, 1: nan, 2: 5.0, 3: 6.0}}

In [ ]:
c